Tekla.Structures.ModelInternal.DelegateFake.ExportGetAttributeFiles(Tekla.Structures.ModelInternal.dotGetAttributeFiles_t@)
DO NOT USE! For internal usage only!
data: The data.
Returns: Number of files found.

Tekla.Structures.ModelInternal.DelegateFake.ExportGetAttributeFilesWithPrefix(Tekla.Structures.ModelInternal.dotGetAttributeFiles_t@)
DO NOT USE! For internal usage only!
data: The data.
Returns: Number of files found.

Tekla.Structures.ModelInternal.DelegateFake.ExportGetShapeMetadata(Tekla.Structures.ModelInternal.dotClientId_t@,System.String)
DO NOT USE! For internal usage only.
ClientId: ClientId for this session
guid: Shape GUID///
Returns: always throws

Tekla.Structures.ModelInternal.DelegateFake.ExportCreateLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.DelegateFake.ExportSelectLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.DelegateFake.ExportModifyLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.DelegateFake.ExportCreateLegSurfaceByFace(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,System.Int32,System.Int32)
